Larkspur-Wang/moddable/modules/io/audioin/esp32/audioin.c
/*
 * Copyright (c) 2024-2025 Moddable Tech, Inc.
 *
 *   This file is part of the Moddable SDK Runtime.
 *
 *   The Moddable SDK Runtime is free software: you can redistribute it and/or modify
 *   it under the terms of the GNU Lesser General Public License as published by
 *   the Free Software Foundation, either version 3 of the License, or
 *   (at your option) any later version.
 *
 *   The Moddable SDK Runtime is distributed in the hope that it will be useful,
 *   but WITHOUT ANY WARRANTY; without even the implied warranty of
 *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *   GNU Lesser General Public License for more details.
 * 
 *   You should have received a copy of the GNU Lesser General Public License
 *   along with the Moddable SDK Runtime.  If not, see <http://www.gnu.org/licenses/>.  
 *
 */

#include "xsmc.h"
#include "xsHost.h"
#include "mc.xs.h"
#include "mc.defines.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"

#include "driver/i2s_std.h"
#include "driver/i2s_pdm.h"
#include "esp_adc/adc_continuous.h"
#include "soc/soc_caps.h"

#include <limits.h>
#include <math.h>
#include <stdio.h>

#if defined(CONFIG_IDF_TARGET_ESP32S3)
	#include "esp_timer.h"
	#include "hal/i2s_ll.h"
#endif

#include "builtinCommon.h"

#ifndef MODDEF_AUDIOIN_I2S_NUM
	#define MODDEF_AUDIOIN_I2S_NUM			(0)
#endif
#ifndef MODDEF_AUDIOIN_I2S_BCK_PIN
	#define MODDEF_AUDIOIN_I2S_BCK_PIN		(32)
#endif
#ifndef MODDEF_AUDIOIN_I2S_LR_PIN
	#define MODDEF_AUDIOIN_I2S_LR_PIN		(33)
#endif
#ifndef MODDEF_AUDIOIN_I2S_MCK_PIN
	#define MODDEF_AUDIOIN_I2S_MCK_PIN		(I2S_GPIO_UNUSED)
#endif
#ifndef MODDEF_AUDIOIN_I2S_FORMAT_I2S
	#define MODDEF_AUDIOIN_I2S_FORMAT_I2S	(0)
#endif
#ifndef MODDEF_AUDIOIN_I2S_DATAIN
	#define MODDEF_AUDIOIN_I2S_DATAIN		(27)
#endif
#ifndef MODDEF_AUDIOIN_I2S_ADC
	#define MODDEF_AUDIOIN_I2S_ADC			(0)
#endif
#ifndef MODDEF_AUDIOIN_I2S_MULTIPLIER
	#define MODDEF_AUDIOIN_I2S_MULTIPLIER	(1)
#endif
#ifndef MODDEF_AUDIOIN_I2S_BIAS
	#define MODDEF_AUDIOIN_I2S_BIAS			(0)
#endif
#ifndef MODDEF_AUDIOIN_I2S_NOISE_FILTER
	#define MODDEF_AUDIOIN_I2S_NOISE_FILTER	(0)
#endif
#ifndef MODDEF_AUDIOIN_I2S_SLOT
	#define MODDEF_AUDIOIN_I2S_SLOT (I2S_STD_SLOT_RIGHT)
#endif
#ifndef MODDEF_AUDIOIN_I2S_RAW_CLOCK_MULTIPLIER
	#define MODDEF_AUDIOIN_I2S_RAW_CLOCK_MULTIPLIER (1)
#endif
#ifndef MODDEF_AUDIOIN_I2S_MONO_PACKED
	#define MODDEF_AUDIOIN_I2S_MONO_PACKED (0)
#endif
#ifndef MODDEF_AUDIOIN_NUMCHANNELS
	#define MODDEF_AUDIOIN_NUMCHANNELS (1)
#endif
#ifndef MODDEF_AUDIOIN_BUFFERSIZE
	#define MODDEF_AUDIOIN_BUFFERSIZE (8192 * 2)
#endif

#if MODDEF_AUDIOIN_I2S_ADC
	#if MODDEF_AUDIOIN_SAMPLERATE < SOC_ADC_SAMPLE_FREQ_THRES_LOW
		#warning "SOC reqires higher audioin sample rate. automatically increasing."
		#undef MODDEF_AUDIOIN_SAMPLERATE
		#define MODDEF_AUDIOIN_SAMPLERATE SOC_ADC_SAMPLE_FREQ_THRES_LOW
	#elif MODDEF_AUDIOIN_SAMPLERATE > SOC_ADC_SAMPLE_FREQ_THRES_HIGH
		#warning "SOC requires lower audioin sample rate. automatically decreasing."
		#undef MODDEF_AUDIOIN_SAMPLERATE
		#define MODDEF_AUDIOIN_SAMPLERATE SOC_ADC_SAMPLE_FREQ_THRES_HIGH
	#endif
#endif

#if MODDEF_AUDIOIN_I2S_PDM
	uint8_t gPDMAudioOutBusy __attribute__((weak)) = 0;
	uint8_t gPDMAudioInBusy = 0;
#endif

#define kADCSampleLength	(256)

#define AUDIO_IN_TIMEOUT	50
#define MAX_INPUT_BLOCK		2048
#define AUDIO_IN_BUFFERSIZE	MODDEF_AUDIOIN_BUFFERSIZE
#define AUDIO_IN_WARMUP_READS	2
#define AUDIO_IN_DIAG_READS	16
#define AUDIO_IN_DIAG_ENABLED 0

enum {
	kStateIdle = 0,
	kStateRecording = 1,
	kStateClosing = 2,
	kStateTerminated = 3
};

struct AudioInputRecord {
	xsMachine	*the;
	xsSlot		object;
	xsSlot		*onReadable;
	uint8_t		pendingCallback;

	uint8_t		numChannels;
	uint32_t	sampleRate;
	uint32_t	bitsPerSample;

#if MODDEF_AUDIOIN_I2S_ADC
	adc_continuous_handle_t handle;
#else
	i2s_chan_handle_t handle;
#endif

	SemaphoreHandle_t	mutex;
	TaskHandle_t		task;
	uint8_t		state;

	uint8_t		*recPos;
	uint8_t		*playPos;
	uint8_t		*endPos;
	uint32_t	bufferSize;
	int32_t		noiseFilter[2];
	uint8_t		buffer[];
};
typedef struct AudioInputRecord AudioInputRecord;
typedef struct AudioInputRecord *AudioInput;

#if 0 && mxInstrument
	#include "modInstrumentation.h"
	#define countBytes	modInstrumentationAdjust
#else
	#define countBytes(what, value)
#endif

static void xs_audioin_mark(xsMachine* the, void* it, xsMarkRoot markRoot);
static void audioInLoop(void *pvParameter);
static void deliverCallbacks(void *the, void *refcon, uint8_t *message, uint16_t messageLength);

#if defined(CONFIG_IDF_TARGET_ESP32S3) && (MODDEF_AUDIOIN_I2S_MCK_PIN != I2S_GPIO_UNUSED)
	static void modAudioCalcClockDiv(uint32_t *div_a, uint32_t *div_b, uint32_t *div_n, uint32_t baseClock, uint32_t targetFreq)
	{
		if (baseClock <= (targetFreq << 1)) {
			*div_n = 2;
			*div_a = 1;
			*div_b = 0;
			return;
		}

		uint32_t save_n = 255;
		uint32_t save_a = 63;
		uint32_t save_b = 62;

		if (targetFreq) {
			float fdiv = (float)baseClock / (float)targetFreq;
			uint32_t n = (uint32_t)fdiv;
			if (n < 256) {
				fdiv -= n;

				float check_base = (float)baseClock;
				while ((int32_t)targetFreq >= 0) {
					targetFreq <<= 1;
					check_base *= 2.0f;
				}
				float check_target = (float)targetFreq;

				uint32_t save_diff = UINT_MAX;
				if (n < 255) {
					save_a = 1;
					save_b = 0;
					save_n = n + 1;
					save_diff = abs((int)(check_target - (check_base / (float)save_n)));
				}

				for (uint32_t a = 1; a < 64; a++) {
					uint32_t b = (uint32_t)roundf(a * fdiv);
					if (a <= b)
						continue;

					uint32_t diff = abs((int)(check_target - ((check_base * a) / (float)((n * a) + b))));
					if (save_diff <= diff)
						continue;

					save_diff = diff;
					save_a = a;
					save_b = b;
					save_n = n;
					if (!diff)
						break;
				}
			}
		}

		*div_n = save_n;
		*div_a = save_a;
		*div_b = save_b;
	}

	static void modAudioInApplyRawClockDiv(uint32_t sampleRate)
	{
		static const uint32_t kPLLDivClock = 120 * 1000 * 1000;
		const uint32_t bits = 16;
		const uint32_t div_m = 8;
		uint32_t div_a, div_b, div_n;
		i2s_dev_t *dev = (0 == MODDEF_AUDIOIN_I2S_NUM) ? &I2S0 : &I2S1;

		modAudioCalcClockDiv(&div_a, &div_b, &div_n, kPLLDivClock / (bits * div_m), sampleRate);

		dev->rx_conf1.rx_bck_div_num = div_m - 1;

		bool yn1 = (div_b > (div_a >> 1));
		if (yn1)
			div_b = div_a - div_b;

		int div_y = 1;
		int div_x = 0;
		if (div_b) {
			div_x = (div_a / div_b) - 1;
			div_y = div_a % div_b;

