Larkspur-Wang/moddable/modules/io/audioin/esp32/audioin.c
			if (0 == div_y) {
				div_y = 1;
				div_b = 511;
			}
		}

		i2s_ll_rx_set_raw_clk_div(dev, div_n, div_x, div_y, div_b, yn1);
#if defined(I2S_RX_CLKM_DIV_X)
		dev->rx_clkm_div_conf.rx_clkm_div_x = div_x;
		dev->rx_clkm_div_conf.rx_clkm_div_y = div_y;
		dev->rx_clkm_div_conf.rx_clkm_div_z = div_b;
		dev->rx_clkm_div_conf.rx_clkm_div_yn1 = yn1;
		dev->rx_clkm_conf.rx_clkm_div_num = div_n;
		dev->rx_clkm_conf.rx_clk_sel = 1;
		dev->tx_clkm_conf.clk_en = 1;
		dev->rx_clkm_conf.rx_clk_active = 1;

		dev->rx_conf.rx_update = 1;
		dev->rx_conf.rx_update = 0;
#endif

#if AUDIO_IN_DIAG_ENABLED
		{
			char debugStr[160];
			snprintf(debugStr, sizeof(debugStr), "audioin rawclk rate=%lu n=%lu a=%lu b=%lu x=%d y=%d yn1=%d m=%lu",
				(unsigned long)sampleRate, (unsigned long)div_n, (unsigned long)div_a, (unsigned long)div_b,
				div_x, div_y, yn1 ? 1 : 0, (unsigned long)div_m);
			modLog_transmit(debugStr);
		}
#endif
	}
#endif

/*
static void blockDump(uint8_t *block, uint32_t amt)
{
	char debugStr[128];
	int i;
	uint16_t *blk = (uint16_t*)block;
	char *pos = debugStr;

	for (i=0; i<amt/2; i++) {
		pos += sprintf(pos, "%04x ", *blk++);
		if (i % 16 == 15) {
			modLog_transmit(debugStr);
			pos = debugStr;
		}
	}
	if (pos != debugStr)
		modLog_transmit(debugStr);
}
*/

static const xsHostHooks xsAudioInHooks = {
	xs_audioin_destructor,
	xs_audioin_mark,
	C_NULL
};

static int amtReadable(AudioInput input) {
	int p = input->recPos - input->playPos;
	if (p < 0)
		p += input->bufferSize;
	return p;
}

void xs_audioin_constructor(xsMachine *the)
{
	uint8_t format = kIOFormatBuffer;
	int32_t bitsPerSample = 16;
	int32_t numChannels = 1;
	int32_t sampleRate = 8000;
	uint32_t bytesPerFrame, bufferSize;
	AudioInput input;
	int i;
	xsmcVars(1);

#ifdef MODDEF_AUDIOIN_BITSPERSAMPLE
	bitsPerSample = MODDEF_AUDIOIN_BITSPERSAMPLE;
#endif
#ifdef MODDEF_AUDIOIN_NUMCHANNELS
	numChannels = MODDEF_AUDIOIN_NUMCHANNELS;
#endif
#ifdef MODDEF_AUDIOIN_SAMPLERATE
	sampleRate = MODDEF_AUDIOIN_SAMPLERATE;
#endif
	format = builtinInitializeFormat(the, format);
	if (kIOFormatBuffer != format)
		xsRangeError("invalid format");
	if (xsmcHas(xsArg(0), xsID_bitsPerSample)) {
		xsmcGet(xsVar(0), xsArg(0), xsID_bitsPerSample);
		bitsPerSample = xsmcToInteger(xsVar(0));
	}
	if (xsmcHas(xsArg(0), xsID_channels)) {
		xsmcGet(xsVar(0), xsArg(0), xsID_channels);
		numChannels = xsmcToInteger(xsVar(0));
	}
	if (xsmcHas(xsArg(0), xsID_sampleRate)) {
		xsmcGet(xsVar(0), xsArg(0), xsID_sampleRate);
		sampleRate = xsmcToInteger(xsVar(0));
	}
	if ((8 != bitsPerSample) && (16 != bitsPerSample))
		xsRangeError("invalid bits per sample");
	if ((1 != numChannels) && (2 != numChannels))
		xsRangeError("invalid number of channels");
	if ((sampleRate < 8000) || (sampleRate > 48000))
		xsRangeError("invalid sample rate");
	if (xsmcHas(xsArg(0), xsID_audioType)) {
		xsmcGet(xsVar(0), xsArg(0), xsID_audioType);
		char *type = xsmcToString(xsVar(0));
		if (c_strcmp(type, "LPCM"))
			xsRangeError("invalid audioType");
	}


#if MODDEF_AUDIOIN_I2S_PDM
	if (gPDMAudioInBusy)
		xsUnknownError("already in use");

	if (gPDMAudioOutBusy)
		xsUnknownError("pdm already in use by audioout");
#endif

	bytesPerFrame = (bitsPerSample * numChannels) >> 3;
//	bufferSize = (bytesPerFrame * sampleRate) >> 5; //??
	bufferSize = AUDIO_IN_BUFFERSIZE;

	input = (AudioInput)c_calloc(1, sizeof(AudioInputRecord) + bufferSize);
	if (!input)
		xsRangeError("not enough memory");
	xsmcSetHostData(xsThis, input);
	xsSetHostHooks(xsThis, (xsHostHooks *)&xsAudioInHooks);

	input->state = kStateIdle;
	input->bufferSize = bufferSize;
	input->recPos = input->buffer;
	input->playPos = input->buffer;
	input->endPos = input->buffer + bufferSize;
	input->numChannels = numChannels;

	input->the = the;
	input->object = xsThis;
	xsRemember(input->object);
	input->onReadable = builtinGetCallback(the, xsID_onReadable);	
	builtinInitializeTarget(the);

	input->sampleRate = sampleRate;
	input->bitsPerSample = bitsPerSample;

#if MODDEF_AUDIOIN_I2S_PDM
	gPDMAudioInBusy = 1;
#endif

	input->mutex = xSemaphoreCreateMutex();
	xTaskCreate(audioInLoop, "audioInput", 4096 + 1024, input, 10, &input->task);
}

void xs_audioin_destructor(void *it)
{
	if (it) {
		AudioInput input = it;
		input->state = kStateClosing;
		if (input->task) {
			xTaskNotify(input->task, kStateClosing, eSetValueWithOverwrite);
			while (kStateClosing == input->state)
				modDelayMilliseconds(1);

			vSemaphoreDelete(input->mutex);
		}

		if (input->pendingCallback) {
			input->state = kStateTerminated;
			return;
		}

		c_free(input);
	}
}

void xs_audioin_close(xsMachine *the)
{
	AudioInput input = xsmcGetHostData(xsThis);
	if (input && xsmcGetHostDataValidate(xsThis, (void *)&xsAudioInHooks)) {
		xsmcSetHostData(xsThis, C_NULL);
		xsmcSetHostDestructor(xsThis, C_NULL);
		xsForget(input->object);
		xs_audioin_destructor(input);
	}
}

void xs_audioin_mark(xsMachine* the, void* it, xsMarkRoot markRoot)
{
	AudioInput input = it;
	if (input->onReadable)
		(*markRoot)(the, input->onReadable);
}

void xs_audioin_level(xsMachine *the)
{
	AudioInput input = xsmcGetHostDataValidate(xsThis, (void *)&xsAudioInHooks);
	xsUnsignedValue requested;
	uint8_t* buffer;
	int16_t* samples;
	int32_t	i;
	double ave = 0.0;

	xsResult = xsArg(0);
	xsmcGetBufferReadable(xsResult, (void **)&buffer, &requested);

	requested /= 2;
	samples = (int16_t*)buffer;
	
	for (i=0; i<requested; i++) {
		int16_t sample = samples[i];
		if (sample < 0) sample = -sample;
		ave += sample;
	}

	int result = c_round(ave / requested);

	xsmcSetInteger(xsResult, result);
}

void xs_audioin_read(xsMachine *the)
{
	AudioInput input = xsmcGetHostDataValidate(xsThis, (void *)&xsAudioInHooks);
	esp_err_t err;
	xsUnsignedValue available, requested;
	xsBooleanValue allocate = 1;
	uint8_t* buffer;

	xSemaphoreTake(input->mutex, portMAX_DELAY);
	available = amtReadable(input);
	xSemaphoreGive(input->mutex);

	if (input->numChannels == 1) {
#if !MODDEF_AUDIOIN_I2S_MONO_PACKED
		available /= 2;					// strip left channel
#endif
	}

	if (0 == available)
		return;		// read returns undefined if nothing available

	if (0 == xsmcArgc)
		requested = available;
	else if (xsReferenceType == xsmcTypeOf(xsArg(0))) {
		xsResult = xsArg(0);
		xsmcGetBufferWritable(xsResult, (void **)&buffer, &requested);
		xsmcSetInteger(xsResult, requested);
		allocate = 0;
	}
	else
		requested = xsmcToInteger(xsArg(0));

	if ((requested <= 0) || (requested > available))
		xsUnknownError("invalid size");

	if (allocate)
		buffer = xsmcSetArrayBuffer(xsResult, C_NULL, requested);

	countBytes(AudioInConsumed, requested);

