Larkspur-Wang/moddable/modules/io/audioin/esp32/audioin.c
	double bias = 0.0;
	int16_t	*samples = (int16_t	*)buffer;

	xsUnsignedValue remaining = requested;
	xSemaphoreTake(input->mutex, portMAX_DELAY);
	if (input->recPos < input->playPos) {
		available = input->endPos - input->playPos;
		while ((remaining > 0) && (input->playPos < input->endPos)) {
			if (input->numChannels == 2) {
				*samples = (*(uint16_t*)input->playPos);
				bias += *samples++;
				input->playPos += 2;
				*samples = (*(uint16_t*)input->playPos);
				bias += *samples++;
				input->playPos += 2;
				remaining -= 4;
			}
			else {
#if MODDEF_AUDIOIN_I2S_MONO_PACKED
				*samples = *((uint16_t*)input->playPos);
				bias += *samples++;
				input->playPos += 2;
#else
				*samples = (*(uint32_t*)input->playPos) & 0xffff;		// take the bottom 16 bits
				bias += *samples++;
				input->playPos += 4;
#endif
				remaining -= 2;
			}
		}
		if (input->playPos == input->endPos)
			input->playPos = input->buffer;
	}
	if (input->recPos != input->playPos) {
		while (input->recPos > input->playPos) {
			if (0 == remaining)
				break;
			if (input->numChannels == 2) {
				*samples = *((uint16_t*)input->playPos);
				bias += *samples++;
				input->playPos += 2;
				*samples = *((uint16_t*)input->playPos);
				bias += *samples++;
				input->playPos += 2;
				remaining -= 4;
			}
			else {
#if MODDEF_AUDIOIN_I2S_MONO_PACKED
				*samples = *((uint16_t*)input->playPos);
				bias += *samples++;
				input->playPos += 2;
#else
				*samples = (*(uint32_t*)input->playPos) & 0xffff;		// take the bottom 16 bits
				bias += *samples++;
				input->playPos += 4;
#endif
				remaining -= 2;
			}
		}
	}
	xSemaphoreGive(input->mutex);

	int32_t i;
	samples = (uint16_t *)buffer;
	requested /= 2;		// samples
	bias /= requested;

#if (1 != MODDEF_AUDIOIN_I2S_MULTIPLIER) || MODDEF_AUDIOIN_I2S_BIAS || MODDEF_AUDIOIN_I2S_NOISE_FILTER
	for (i=0; i<requested; i++) {
#if MODDEF_AUDIOIN_I2S_BIAS
		int32_t sample = samples[i] - bias;
#else
		int32_t sample = samples[i];
#endif
		sample *= MODDEF_AUDIOIN_I2S_MULTIPLIER;
#if MODDEF_AUDIOIN_I2S_NOISE_FILTER
		{
			const int channelIndex = (input->numChannels > 1) ? (i % input->numChannels) : 0;
			const int32_t filtered = ((sample * (256 - MODDEF_AUDIOIN_I2S_NOISE_FILTER)) + (input->noiseFilter[channelIndex] * MODDEF_AUDIOIN_I2S_NOISE_FILTER) + 128) >> 8;
			input->noiseFilter[channelIndex] = filtered;
			sample = filtered;
		}
#endif
		if (sample > 32767) 		// clip
			sample = 32767;
		else if (sample < -32768)
			sample = -32768;
		samples[i] = (int16_t)sample;
	}
#endif
}

void deliverCallbacks(void *the, void *refcon, uint8_t *message, uint16_t messageLength)
{
	AudioInput input = refcon;
	uint32_t bytes_read;

	if (kStateTerminated == input->state) {
		c_free(input);
		return;
	} 

	xsBeginHost(input->the);

	bytes_read = amtReadable(input);
	if (input->numChannels == 1) {		// only lower 16 bits
#if !MODDEF_AUDIOIN_I2S_MONO_PACKED
		bytes_read /= 2;
#endif
	}

	if (0 != bytes_read) {
		xsResult = xsAccess(input->object);
		xsCallFunction1(xsReference(input->onReadable), xsResult, xsInteger(bytes_read));
	}

	input->pendingCallback = 0;

	xsEndHost(input->the);
}

void audioInLoop(void *pvParameter)
{
	AudioInput input = pvParameter;
	uint8_t stopped = true, enabled = false;
#if AUDIO_IN_DIAG_ENABLED
	int audioInDiagReads = 0;
	int64_t audioInDiagStart = 0;
	int64_t audioInDiagLast = 0;
#endif

// ### HW CONFIGURATION
#if MODDEF_AUDIOIN_I2S_ADC
#error untested
	adc_continuous_handle_t adcHandle;
	adc_continuous_handle_cfg_t adc_config = {
		.max_store_buf_size = 1024,
		.conv_frame_size = kADCSampleLength,
	};
	ESP_ERROR_CHECK(adc_continuous_new_handle(&adc_config, &adcHandle));

	adc_continuous_config_t dig_cfg = {
		.sample_freq_hz = input->sampleRate,
		.conv_mode = ADC_CONF_SINGLE_UNIT_1,
		.format = ADC_DIGI_OUTPUT_FORMAT_TYPE1,
	};

	adc_digi_pattern_config_t adc_pattern[1] = {0};
	adc_pattern[0].atten = ADC_ATTEN_DB_11;
	adc_pattern[0].channel = ADC_CHANNEL_6;		//@@ config
	adc_pattern[0].unit = ADC_UNIT_1;			//@@ config
	adc_pattern[0].bit_width = ADC_BITWIDTH_12;
	dig_cfg.pattern_num = 1;
	dig_cfg.adc_pattern = adc_pattern;
	ESP_ERROR_CHECK(adc_continuous_config(adcHandle, &dig_cfg));

	ESP_ERROR_CHECK(adc_continuous_start(adcHandle));
	input->handle = adcHandle;
#else
	esp_err_t err;

	i2s_chan_config_t chan_cfg = I2S_CHANNEL_DEFAULT_CONFIG(MODDEF_AUDIOIN_I2S_NUM, I2S_ROLE_MASTER);
	err = i2s_new_channel(&chan_cfg, C_NULL, &input->handle);
	if (err) modLog("i2s_new_channel failed");

#if MODDEF_AUDIOIN_I2S_PDM
	i2s_pdm_rx_config_t pdm_rx_cfg = {
		.clk_cfg = I2S_PDM_RX_CLK_DEFAULT_CONFIG(input->sampleRate),
		.slot_cfg = I2S_PDM_RX_SLOT_DEFAULT_CONFIG(
				input->bitsPerSample == 8 ? I2S_DATA_BIT_WIDTH_8BIT : I2S_DATA_BIT_WIDTH_16BIT,
				I2S_SLOT_MODE_MONO),
		.gpio_cfg = {
			.clk = MODDEF_AUDIOIN_I2S_LR_PIN,
			.din = MODDEF_AUDIOIN_I2S_DATAIN,
			.invert_flags = {
				.clk_inv = false,
			}
		}
	};

	pdm_rx_cfg.slot_cfg.slot_mask = MODDEF_AUDIOIN_I2S_SLOT;
	pdm_rx_cfg.clk_cfg.dn_sample_mode = I2S_PDM_DSR_16S;

	err = i2s_channel_init_pdm_rx_mode(input->handle, &pdm_rx_cfg);
	if (err) {
		i2s_del_channel(input->handle);
		input->handle = C_NULL;
		modLog("i2s_channel_init_pdm_rx_mode failed");
	}
#else
	i2s_std_config_t rx_std_cfg = {
		.clk_cfg = I2S_STD_CLK_DEFAULT_CONFIG(input->sampleRate),
#if MODDEF_AUDIOIN_I2S_FORMAT_I2S
		.slot_cfg = I2S_STD_PHILIPS_SLOT_DEFAULT_CONFIG(I2S_DATA_BIT_WIDTH_16BIT,
			(2 == MODDEF_AUDIOIN_NUMCHANNELS) ? I2S_SLOT_MODE_STEREO : I2S_SLOT_MODE_MONO),
#else
		.slot_cfg = I2S_STD_MSB_SLOT_DEFAULT_CONFIG(I2S_DATA_BIT_WIDTH_16BIT,
			(2 == MODDEF_AUDIOIN_NUMCHANNELS) ? I2S_SLOT_MODE_STEREO : I2S_SLOT_MODE_MONO),
#endif
		.gpio_cfg = {
			.mclk = MODDEF_AUDIOIN_I2S_MCK_PIN,
			.bclk = MODDEF_AUDIOIN_I2S_BCK_PIN,
			.ws = MODDEF_AUDIOIN_I2S_LR_PIN,
			.dout = I2S_GPIO_UNUSED,
			.din = MODDEF_AUDIOIN_I2S_DATAIN,
			.invert_flags = {
				.mclk_inv = false,
				.bclk_inv = false,
				.ws_inv = false,
			}
		}
	};
#if defined(I2S_CLK_SRC_PLL_160M) && !defined(CONFIG_IDF_TARGET_ESP32P4)
	rx_std_cfg.clk_cfg.clk_src = I2S_CLK_SRC_PLL_160M;
#else
	rx_std_cfg.clk_cfg.clk_src = I2S_CLK_SRC_DEFAULT;
#endif
#ifdef MODDEF_AUDIOIN_I2S_MCLK_MULTIPLE
	rx_std_cfg.clk_cfg.mclk_multiple = MODDEF_AUDIOIN_I2S_MCLK_MULTIPLE;
#endif
#if defined(CONFIG_IDF_TARGET_ESP32S3) && (MODDEF_AUDIOIN_I2S_MCK_PIN != I2S_GPIO_UNUSED)
	// M5Unified initializes S3 codec mics with this dummy clock before
	// applying the raw RX divider below.
	rx_std_cfg.clk_cfg.sample_rate_hz = 48000;
	rx_std_cfg.clk_cfg.mclk_multiple = I2S_MCLK_MULTIPLE_128;
#endif
	rx_std_cfg.slot_cfg.data_bit_width = (8 == input->bitsPerSample) ? I2S_DATA_BIT_WIDTH_8BIT : I2S_DATA_BIT_WIDTH_16BIT;
	rx_std_cfg.slot_cfg.ws_width = (8 == input->bitsPerSample) ? I2S_DATA_BIT_WIDTH_8BIT : I2S_DATA_BIT_WIDTH_16BIT;
	rx_std_cfg.slot_cfg.slot_bit_width = (8 == input->bitsPerSample) ? I2S_SLOT_BIT_WIDTH_8BIT : I2S_SLOT_BIT_WIDTH_16BIT;
	rx_std_cfg.slot_cfg.slot_mode = (2 == MODDEF_AUDIOIN_NUMCHANNELS) ? I2S_SLOT_MODE_STEREO : I2S_SLOT_MODE_MONO;
	rx_std_cfg.slot_cfg.slot_mask = (2 == MODDEF_AUDIOIN_NUMCHANNELS)
		? I2S_STD_SLOT_BOTH
		: MODDEF_AUDIOIN_I2S_SLOT;
	rx_std_cfg.slot_cfg.ws_pol = false;
#if !SOC_I2S_HW_VERSION_1
#ifdef MODDEF_AUDIOIN_I2S_LEFT_ALIGN
	rx_std_cfg.slot_cfg.left_align = MODDEF_AUDIOIN_I2S_LEFT_ALIGN;
#endif
	rx_std_cfg.slot_cfg.big_endian = false;
	rx_std_cfg.slot_cfg.bit_order_lsb = false;
#else
	rx_std_cfg.slot_cfg.msb_right = false;
#endif
#ifdef MODDEF_AUDIOIN_I2S_BIT_SHIFT
	rx_std_cfg.slot_cfg.bit_shift = MODDEF_AUDIOIN_I2S_BIT_SHIFT;
#endif

