Larkspur-Wang/moddable/modules/io/audioin/esp32/audioin.c
		err = i2s_channel_init_std_mode(input->handle, &rx_std_cfg);
		if (err) {
			i2s_del_channel(input->handle);
			modLog("i2s_channel_init failed");
		}
#if defined(CONFIG_IDF_TARGET_ESP32S3) && (MODDEF_AUDIOIN_I2S_MCK_PIN != I2S_GPIO_UNUSED)
		else
			modAudioInApplyRawClockDiv(input->sampleRate * MODDEF_AUDIOIN_I2S_RAW_CLOCK_MULTIPLIER);
#endif
#endif

	err = i2s_channel_enable(input->handle);
	if (err) {
		i2s_del_channel(input->handle);
		input->handle = C_NULL;
		modLog("i2s_channel_enable failed");
	}
	enabled = true;
#endif

	if (C_NULL == input->handle)
		goto done;

	while (true) {
		size_t bytes_read = 0;

		if (kStateRecording != input->state) {
			uint32_t newState;

			if (!stopped) {
#if MODDEF_AUDIOIN_I2S_ADC
				adc_continuous_stop(input->handle);
#else
				if (enabled)
					i2s_channel_disable(input->handle);
				enabled = false;
#endif
				stopped = true;

				input->playPos = input->recPos = input->buffer;
			}

			if ((kStateClosing == input->state) || (kStateTerminated == input->state))
				break;

			xTaskNotifyWait(0, 0, &newState, portMAX_DELAY);
			continue;
		}

		if (stopped) {
#if MODDEF_AUDIOIN_I2S_ADC
			adc_continuous_enable(input->handle);
#else
			if (!enabled)
				i2s_channel_enable(input->handle);
			enabled = true;
#endif

			// Discard the first couple of RX blocks after enabling to match the
			// StickS3/M5 warmup behavior and avoid exporting startup silence.
#if !MODDEF_AUDIOIN_I2S_ADC
			{
				uint8_t warmup[MAX_INPUT_BLOCK];
				size_t warmupBytes = 0;
				size_t warmupTotal = 0;
				for (int warmupRead = 0; warmupRead < AUDIO_IN_WARMUP_READS; warmupRead++) {
					err = i2s_channel_read(input->handle, warmup, sizeof(warmup), &warmupBytes, AUDIO_IN_TIMEOUT);
					warmupTotal += warmupBytes;
					if (err)
						break;
				}
#if AUDIO_IN_DIAG_ENABLED
				{
					char debugStr[128];
					snprintf(debugStr, sizeof(debugStr), "audioin warmup reads=%d bytes=%lu err=%d",
						AUDIO_IN_WARMUP_READS, (unsigned long)warmupTotal, err);
					modLog_transmit(debugStr);
				}
#endif
			}
#endif
#if AUDIO_IN_DIAG_ENABLED
			audioInDiagReads = 0;
			audioInDiagStart = audioInDiagLast = esp_timer_get_time();
#endif
			xSemaphoreTake(input->mutex, portMAX_DELAY);
			input->playPos = input->recPos = input->buffer;
			xSemaphoreGive(input->mutex);
			stopped = false;
		}

#if MODDEF_AUDIOIN_I2S_ADC
#error untested
		uint32_t use = sizeof(input);
		uint32_t needed = requested * sizeof(adc_digi_output_data_t);
		if (use > needed) use = needed;
		uint32_t used;

		err = adc_continuous_read(input->handle, input, use, &used, 17);
		if (err) break;

		used /= sizeof(adc_digi_output_data_t);
		requested -= used;

        adc_digi_output_data_t *in = (adc_digi_output_data_t *)input;
#if 8 == MODDEF_AUDIOIN_BITSPERSAMPLE
		uint8_t *out = (uint8_t *)buffer;
		while (used--) {
			*out++ in->type1.data >> 4;
			in++;
		}
		samples = (void *)out;
#else // 16 == MODDEF_AUDIOIN_BITSPERSAMPLE
		uint16_t *out = (uint16_t *)buffer;
		while (used--) {
			*out++ = (in->type1.data - 2048) * 8;
			in++;
		}
		samples = (void *)out;
#endif
    
#elif MODDEF_AUDIOIN_I2S_PDM && (8 == MODDEF_AUDIOIN_BITSPERSAMPLE)
   		int8_t *out = buffer;
		int i;
		while (sampleCount) {
			const int tmpCount = 512;
			int16_t tmp[tmpCount];
			int use = sampleCount;
			if (use > tmpCount)
				use = tmpCount;
			err = i2s_channel_read(input->handle, (char *)tmp, use << 1, &bytes_read, AUDIO_IN_TIMEOUT);
			if (err) break;

			for (i=0; i < use; i++)
				*out++ = (tmp[i] >> 8) ^ 0x80;
			sampleCount -= use;
		}
#else
		xSemaphoreTake(input->mutex, portMAX_DELAY);
		uint32_t	amt;
		if (input->playPos > input->recPos) {
			amt = input->playPos - input->recPos;
			amt = (amt > 4) ? (amt - 4) : 0;
		}
		else
			amt = input->endPos - input->recPos;
		if (amt == 0) {
			input->recPos = input->buffer;
			amt = (input->playPos > input->buffer) ? (input->playPos - input->buffer) : 0;
			amt = (amt > 4) ? (amt - 4) : 0;
		}
#if MODDEF_AUDIOIN_I2S_MONO_PACKED && (1 == MODDEF_AUDIOIN_NUMCHANNELS)
		amt &= ~1;
#else
		amt &= ~3;
#endif
		xSemaphoreGive(input->mutex);
		amt = (amt > MAX_INPUT_BLOCK) ? MAX_INPUT_BLOCK : amt;
		if (amt > 0) {
			err = i2s_channel_read(input->handle, input->recPos, amt, &bytes_read, AUDIO_IN_TIMEOUT);
			if (bytes_read) {
				xSemaphoreTake(input->mutex, portMAX_DELAY);
				input->recPos += bytes_read;
				xSemaphoreGive(input->mutex);
			}
#if AUDIO_IN_DIAG_ENABLED
			if (audioInDiagReads < AUDIO_IN_DIAG_READS) {
				int64_t now = esp_timer_get_time();
				char debugStr[160];
				snprintf(debugStr, sizeof(debugStr), "audioin read #%d t=%ld dt=%ld req=%lu got=%lu err=%d",
					audioInDiagReads,
					(long)((now - audioInDiagStart) / 1000),
					(long)((now - audioInDiagLast) / 1000),
					(unsigned long)amt,
					(unsigned long)bytes_read,
					err);
				modLog_transmit(debugStr);
				audioInDiagLast = now;
				audioInDiagReads++;
			}
#endif
		}
#endif

		if (input->onReadable && (bytes_read > 0)) {
			if (!input->pendingCallback) {
				input->pendingCallback = 1;
				modMessagePostToMachine(input->the, C_NULL, 0, deliverCallbacks, input);
			}
		}

		countBytes(AudioInRead, bytes_read);
	}

	// ## HW shutdown
	if (input->handle) {
#if MODDEF_AUDIOOUT_I2S_ADC
		adc_continuous_deinit(input->handle);
#else
		if (enabled)
			i2s_channel_disable(input->handle);
		i2s_del_channel(input->handle);
#endif
	}

done:
#if MODDEF_AUDIOIN_I2S_PDM
	gPDMAudioInBusy = 0;
#endif

	input->state = kStateTerminated;
	input->task = C_NULL;

	vTaskDelete(C_NULL);
}

void xs_audioin_start(xsMachine *the)
{
	AudioInput input = xsmcGetHostDataValidate(xsThis, (void *)&xsAudioInHooks);
	input->state = kStateRecording;
	xTaskNotify(input->task, kStateRecording, eSetValueWithOverwrite);
}

void xs_audioin_stop(xsMachine *the)
{
	AudioInput input = xsmcGetHostDataValidate(xsThis, (void *)&xsAudioInHooks);
	input->state = kStateIdle;
	xTaskNotify(input->task, kStateIdle, eSetValueWithOverwrite);
}

void xs_audioin_get_format(xsMachine *the)
{
	xsmcGetHostDataValidate(xsThis, (void *)&xsAudioInHooks);
	builtinGetFormat(the, kIOFormatBuffer);
}

void xs_audioin_set_format(xsMachine *the)
{
	xsmcGetHostDataValidate(xsThis, (void *)&xsAudioInHooks);
	uint8_t format = builtinSetFormat(the);
	if (kIOFormatBuffer != format)
		xsRangeError("invalid format");
}

void xs_audioin_get_bitsPerSample(xsMachine *the)
{
	AudioInput input = xsmcGetHostDataValidate(xsThis, (void *)&xsAudioInHooks);
	xsmcSetInteger(xsResult, input->bitsPerSample);
}

void xs_audioin_get_channels(xsMachine *the)
{
	AudioInput input = xsmcGetHostDataValidate(xsThis, (void *)&xsAudioInHooks);
	xsmcSetInteger(xsResult, input->numChannels);
}

void xs_audioin_get_sampleRate(xsMachine *the)
{
	AudioInput input = xsmcGetHostDataValidate(xsThis, (void *)&xsAudioInHooks);
	xsmcSetInteger(xsResult, input->sampleRate);
}
